#!/usr/bin/env python3
# -*- coding: utf-8 -*-

L = {
    'essence': {
        'n.': ['本质，精髓']
    },
    'pastel': {
        'a.': ['彩色蜡笔的', '柔和的'], 
        'n.': ['彩色蜡笔（画）']
    },
    'cultivate': {
        'vt.': ['耕种', '培养']
    },
    'recover': {
        'v.': ['复原，恢复', '重新获得', '收回']
    },
    'substitute': {
        'n.': ['代替者，代替品'],
        'v.': ['代替']
    },
    'renaissance': {
        'n.': ['（欧洲14至16世纪的）文艺复兴，文艺复兴期', '复兴，再生']
    },
    'sweat': {
        'n.': ['汗', '一身汗'],
        'v.': ['（使）出汗']
    },
    'underscore': {
        'vt.': ['强调', '在...之下画线'],
        'n.': ['底线']
    },
    'conform': {
        'vi.': ['遵守，服从', '符合', '适应']
    },
    'husk': {
        'n.': ['（果类、谷物等的）外壳，外皮'],
        'vt.': ['去壳，削皮']
    },
    'tide': {
        'v.': ['涨落'],
        'n.': ['潮，潮汐', '潮流，趋势']
    },
    'decade': {
        'n.': ['十年，十年期']
    },
    'pluralism': {
        'n.': ['多元化，多元性', '多元主义']
    },
    'vagrant': {
        'n.': ['无业游民，流浪者'],
        'a.': ['漂泊的']
    },
    'incline': {
        'v.': ['（使）倾斜', '（使）倾向于'],
        'n.': ['斜坡，斜面']
    },
    'grievous': {
        'a.': ['令人忧伤的', '极严重的']
    },
    'saucy': {
        'a.': ['无礼的', '俏皮的', '漂亮的']
    },
    'disproportionate': {
        'a.': ['不成比例的']
    },
    'withhold': {
        'vt.': ['拒绝给，不给', '抑制', '忍住']
    },
    'nosy': {
        'a.': ['爱管闲事的，好打听的']
    },
    'stumble': {
        'vi.': ['绊脚', '蹒跚而行', '（说话等时）结巴']
    },
    'imaginative': {
        'a.': ['富有想象力的', '创新的']
    },
    'chaotic': {
        'a.': ['混乱的，无秩序的']
    },
    'renown': {
        'n.': ['名望，声誉']
    },
    'scroll': {
        'n.': ['卷轴', '纸卷，画卷', '名册']
    },
    'embrace': {
        'v.': ['拥抱', '包含', '欣然接受'],
        'n.': ['拥抱']
    },
    'obliterate': {
        'vt.': ['覆盖', '消灭', '忘却']
    },
    'colonization': {
        'n.': ['殖民地化']
    },
    'affiliate': {
        'vt.': ['使隶属于'],
        'n.': ['分公司']
    },
    'rancorous': {
        'a.': ['怨恨的，满怀恶意的']
    },
    'subculture': {
        'n.': ['（某群体所特有的）亚文化行为观念，次文化']
    },
    'forum': {
        'n.': ['讨论', '讨论会']
    },
    'participant': {
        'n.': ['参与者', '参赛者']
    },
    'strain': {
        'n.': ['拉力，压力，张力', '扭伤'],
        'vt.': ['扭伤', '使紧张', '拉紧']
    },
    'vary': {
        'v.': ['改变，变化']
    },
    'mediate': {
        'v.': ['调解，调停，斡旋']
    },
    'sensitive': {
        'a.': ['敏感的', '灵敏的']
    },
    'exposition': {
        'n.': ['展览会，博览会', '阐释']
    },
    'sphere': {
        'n.': ['球（体）', '范围，领域', '阶层']
    },
    'discharge': {
        'n.': ['流出物', '放电'],
        'v.': ['释放', '放（电）', '解雇', '清偿', '履行']
    },
    'giant': {
        'a.': ['巨大的', '超群的'],
        'n.': ['巨大的动物（或植物）', '才智超群的人']
    },
    'melt': {
        'v.': ['（使）融化，（使）熔化', '（使）溶化', '（使）消散']
    },
    'solicit': {
        'v.': ['恳请', '乞求', '征求', '勾引', '招揽（生意）']
    },
    'leisure': {
        'n.': ['空闲，闲暇']
    },
    'unravel': {
        'v.': ['澄清', '解体，瓦解', '解开']
    },
    'nail': {
        'n.': ['指甲，爪', '钉'],
        'vt.': ['将...钉牢，钉住']
    },
    'attain': {
        'vt.': ['到达', '获得']
    },
    'constitute': {
        'v.': ['组成', '设立', '制定']
    },
    'unsubstantiated': {
        'a.': ['未经证实的，无事实根据的']
    },
    'stylized': {
        'a.': ['（绘画、写作等手法）非写实的', '程式化的']
    },
    'intrepid': {
        'a.': ['勇敢的，无畏的']
    },
    'nominee': {
        'n.': ['被提名者，被任命者']
    },
    'panic': {
        'n./v.': ['惊慌']
    },
    'lure': {
        'vt.': ['吸引，诱惑'],
        'n.': ['诱惑力', '诱饵']
    },
    'routine': {
        'n.': ['例行公事', '惯例，常规'],
        'a.': ['例行的', '常规的']
    },
    'solution': {
        'n.': ['溶液', '解答，解决（方法）']
    },
    'revere': {
        'vt.': ['尊敬，敬畏']
    },
    'idealize': {
        'vt.': ['将...理想化']
    },
    'flash': {
        'n.': ['闪光', '闪现'],
        'vi.': ['闪光', '反射']
    },
    'secrete': {
        'vt.': ['分泌', '藏匿，躲藏']
    },
    'issue': {
        'n.': ['问题，争论点', '发行', '（报刊的）一期'],
        'vt.': ['颁布', '发行']
    },
    'aria': {
        'n.': ['独唱曲，咏叹调']
    },
    'facilitate': {
        'vt.': ['推动，促进']
    },
    'electricity': {
        'n.': ['电', '电流']
    },
    'progressive': {
        'a.': ['进步的', '逐步的，渐进的', '【语】进行时的']
    },
    'reef': {
        'n.': ['礁，暗礁']
    },
    'president': {
        'n.': ['总统，（大学）校长，（大会）主席']
    },
    'feeble': {
        'a.': ['虚弱的，衰弱的，无力的']
    },
    'influx': {
        'n.': ['注入，涌入']
    },
    'receptacle': {
        'n.': ['容器', '插座']
    },
    'accent': {
        'n.': ['重音', '口音', '重音符号'],
        'vt.': ['重读']
    },
    'kernel': {
        'n.': ['（硬壳果）仁', '（谷物去核后的）粒', '核心，要点']
    },
    'secure': {
        'a.': ['安全的，有保障的', '可靠的', '确定的', '稳固的'],
        'vt.': ['获得', '确保']
    },
    'electron': {
        'n.': ['电子']
    },
    'segment': {
        'n.': ['音段', '段，部分']
    },
    'nourish': {
        'vt.': ['滋养', '养育']
    },
    'engulf': {
        'vt.': ['吞没']
    },
    'bedrock': {
        'n.': ['基础，根基', '基岩']
    },
    'due': {
        'a.': ['到期的', '预期的', '应得的', '恰当的，适当的', '应支付的']
    },
    'unprecedented': {
        'a.': ['空前的']
    },
    'expel': {
        'vt.': ['开除', '驱逐', '排出']
    },
    'verbal': {
        'a.': ['口头的', '言辞的', '动词的']
    },
    'deadline': {
        'n.': ['最后期限，截止日期']
    },
    'tolerate': {
        'vt.': ['忍受', '容许，承认']
    },
    'identity': {
        'n.': ['身份', '特征，特性', '同一性']
    },
    'seep': {
        'v.': ['漏出，渗漏']
    },
    'patriarch': {
        'n.': ['家长，族长']
    },
    'engage': {
        'v.': ['（使）从事于，（使）忙于', '吸引', '（使）订婚', '聘用']
    },
    'constrain': {
        'vt.': ['束缚，限制']
    },
    'innocent': {
        'a.': ['天真的', '清白的', '无恶意的']
    }
}
