#!/usr/bin/env python3
# -*- coding: utf-8 -*-

L = {
    'glue': {
        'vt.': ['胶合，黏合', '紧附于'],
        'n.': ['胶，胶水']
    },
    'inflation': {
        'n.': ['通货膨胀，物价上涨', '（充气而引起的）膨胀']
    },
    'certificate': {
        'n.': ['证书，证明书', '文凭，结业证书']
    },
    'summit': {
        'n.': ['（山等的）最高点，峰顶，极点', '峰会']
    },
    'nucleus': {
        'n.': ['核，核子，原子核', '细胞核', '核心']
    },
    'attribute': {
        'n.': ['属性，特征'],
        'vt.': ['把...归于']
    },
    'planetary': {
        'a.': ['行星的']
    },
    'lash': {
        'v.': ['将（物品）系牢，捆绑', '（风、雨等）猛烈打击', '鞭打', '猛烈抨击，严厉斥责'],
        'n.': ['鞭打', '睫毛']
    },
    'delicate': {
        'a.': ['易损的', '微妙的', '精巧的', '娇弱的，纤细的']
    },
    'proficient': {
        'a.': ['熟练的，精通的']
    },
    'repertory': {
        'n.': ['保留剧目', '保留剧目轮演', '库存，储备', '仓库']
    },
    'enormous': {
        'a.': ['巨大的，极大的']
    },
    'unify': {
        'vt.': ['统一，联合']
    },
    'relief': {
        'n.': ['缓解，减轻，轻松', '援救，救济', '宽慰', '浮雕（法或作品）']
    },
    'deceptive': {
        'a.': ['欺骗性的，导致误解的']
    },
    'miracle': {
        'n.': ['奇事，奇迹']
    },
    'simultaneous': {
        'a.': ['同时的，同步的']
    },
    'paradigm': {
        'n.': ['范例，典范']
    },
    'foliage': {
        'n.': ['（植物的）叶']
    },
    'spontaneous': {
        'a.': ['自发的，自然产生的', '自然的，无雕饰的']
    },
    'quarry': {
        'n.': ['采石场，石矿', '猎物，追捕的对象'],
        'v.': ['采石', '采集']
    },
    'improvise': {
        'v.': ['即兴创作', '临时准备']
    },
    'tragedy': {
        'n.': ['惨事，灾难', '悲剧（作品）']
    },
    'outbreak': {
        'n.': ['发作', '爆发']
    },
    'plateau': {
        'n.': ['高原', '（上升后的）稳定期，停滞期'],
        'vi.': ['保持稳定水平']
    },
    'novel': {
        'a.': ['新颖的'],
        'n.': ['（长篇）小说']
    },
    'decay': {
        'v./n.': ['腐烂，腐朽', '衰退，衰落']
    },
    'avenue': {
        'n.': ['途径，手段', '大街']
    },
    'potency': {
        'n.': ['影响力，支配力', '效力']
    },
    'benevolent': {
        'a.': ['慈善的', '善心的']
    },
    'causal': {
        'a.': ['原因的，因果关系的']
    },
    'acquisition': {
        'n.': ['习得（物），获得（物）', '收购，购置']
    },
    'unanimous': {
        'a.': ['全体一致的，一致同意的']
    },
    'ornamental': {
        'a.': ['装饰性的，装饰用的'],
        'n.': ['装饰物']
    },
    'blunt': {
        'a.': ['钝的', '不敏感', '直率的'],
        'vt.': ['使迟钝', '使减弱']
    },
    'credence': {
        'n.': ['可信性，真实性', '信任', '信念']
    },
    'fictitious': {
        'a.': ['虚构的', '假的', '假装的，虚伪的']
    },
    'somber': {
        'a.': ['昏暗的', '忧郁的']
    },
    'doodle': {
        'vi.': ['乱涂，胡画']
    },
    'allocate': {
        'vt.': ['分配，分派，把...拨给']
    },
    'blurt': {
        'vt.': ['脱口而出']
    },
    'cradle': {
        'n.': ['摇篮', '发源地']
    },
    'deceitful': {
        'a.': ['欺诈的，惯于欺骗的，不诚实的']
    },
    'aftermath': {
        'n.': ['后果，余波']
    },
    'bleak': {
        'a.': ['阴冷的', '无望的，令人沮丧的', '乏味的', '荒凉的']
    },
    'diminution': {
        'n.': ['减少（量），缩减（量）']
    },
    'metaphor': {
        'n.': ['隐喻，暗喻']
    },
    'committee': {
        'n.': ['委员会']
    },
    'tropic': {
        'n.': ['回归线', '热带地区'],
        'a.': ['热带的']
    },
    'disrupt': {
        'vt.': ['使中断', '扰乱', '使分裂，使瓦解']
    },
    'exalted': {
        'a.': ['崇高的，高贵的，显赫的']
    },
    'octopus': {
        'n.': ['章鱼']
    },
    'ambience': {
        'n.': ['周围环境，气氛']
    },
    'spectacle': {
        'n.': ['精彩的表演', '壮观的场面', '奇观', '壮丽的景象', '眼镜']
    },
    'voyage': {
        'n.': ['旅行', '航程']
    },
    'revitalize': {
        'vt.': ['使恢复生机，使再生', '使更强壮']
    },
    'onslaught': {
        'n.': ['冲击', '攻击，猛攻']
    },
    'arid': {
        'a.': ['干旱的', '贫瘠的', '无趣的']
    },
    'demolish': {
        'vt.': ['拆除', '破坏', '驳倒，推翻（论点等）']
    },
    'clam': {
        'n.': ['蛤，蛤肉', '<口>守口如瓶的人，寡言的人']
    },
    'nicotine': {
        'n.': ['尼古丁']
    },
    'guideline': {
        'n.': ['指导方针，准则，行动纲领']
    },
    'signal': {
        'n.': ['信号，暗号', '标志'],
        'v.': ['发信号，示意', '标志'],
        'a.': ['显要的，重大的']
    },
    'junction': {
        'n.': ['交叉点，汇合处', '连接，结合']
    },
    'abnormal': {
        'a.': ['反常的，变态的']
    },
    'sympathy': {
        'n.': ['同情，同情心', '赞同，支持']
    },
    'intellect': {
        'n.': ['智力，理解力', '知识分子']
    },
    'thrifty': {
        'a.': ['节省的，节俭的']
    },
    'drought': {
        'n.': ['干旱（期），旱灾']
    },
    'abandon': {
        'vt.': ['离弃，放弃'],
        'n.': ['放纵，放任']
    },
    'trivial': {
        'a.': ['琐碎的，微不足道的']
    },
    'damp': {
        'a.': ['潮湿的'],
        'n.': ['潮湿', '湿气'],
        'vt.': ['弄湿', '减弱，抑制']
    },
    'staggering': {
        'a.': ['巨大的', '势不可挡的', '惊人的，令人吃惊的']
    },
    'ignorant': {
        'a.': ['无知的，愚昧的', '无知觉的']
    },
    'emission': {
        'n.': ['散发物，排放物', '发射，排放']
    },
    'vertebrate': {
        'n.': ['脊椎动物'],
        'a.': ['有脊椎的']
    },
    'range': {
        'n.': ['范围', '山脉', '一系列', '射程，距离'],
        'v.': ['（在某范围内）变动', '散布', '漫游']
    },
    'emotion': {
        'n.': ['感情，激情，情绪']
    },
    'stiff': {
        'a.': ['硬的，僵直的', '呆板的', '拘谨的', '艰难的，费劲的', '（风等）强烈的'],
        'ad.': ['极其，非常', '僵硬地']
    },
    'boost': {
        'vt.': ['提高，推进', '替...做广告，宣扬'],
        'n.': ['增加，帮助']
    },
    'microprocessor': {
        'n.': ['微处理器']
    },
    'oceanographer': {
        'n.': ['海洋学者']
    },
    'insanity': {
        'n.': ['精神错乱，疯狂']
    },
    'successive': {
        'a.': ['接替的，继承的', '接连的，连续的']
    },
    'alternate': {
        'v.': ['（使）轮流，（使）交替'],
        'a.': ['交替的，轮流的', '间隔的']
    },
    'burgeon': {
        'vi.': ['迅速成长，发展']
    },
    'dull': {
        'a.': ['乏味的，单调的', '迟钝的', '（色彩等）无光泽的', '萧条的', '阴沉的，昏暗的']
    },
    'stanza': {
        'n.': ['（诗）节，段']
    }
}
