#!/usr/bin/env python3
# -*- coding: utf-8 -*-

L = {
    'cowhand': {
        'n.': ['牛仔，牧牛工']
    },
    'spacecraft': {
        'n.': ['航天器，宇宙飞船']
    },
    'disgust': {
        'vt.': ['厌恶，嫌恶']
    },
    'lore': {
        'n.': ['学问，学识', '传说，传统']
    },
    'meticulous': {
        'a.': ['细心的，小心翼翼的']
    },
    'dawn': {
        'n.': ['破晓，黎明', '开始，发端']
    },
    'bruise': {
        'v.': ['（使）出现伤痕', '挫伤'],
        'n.': ['伤痕，擦痕，青肿']
    },
    'abut': {
        'v.': ['邻接，毗邻']
    },
    'condiment': {
        'n.': ['调味品']
    },
    'discourage': {
        'vt.': ['使泄气，使灰心', '阻止，劝阻']
    },
    'glitter': {
        'vi.': ['闪烁，闪耀'],
        'n.': ['灿烂的光辉', '诱惑力，魅力']
    },
    'indignant': {
        'a.': ['愤慨的，恼怒的']
    },
    'amalgamation': {
        'n.': ['融合，合并', '联合，结合']
    },
    'tortuous': {
        'a.': ['扭曲的', '曲折的，蜿蜒的', '含混不清的，拐弯抹角的']
    },
    'noteworthy': {
        'a.': ['显著的，值得注目的']
    },
    'dateline': {
        'n.': ['日期栏', '国际日期变更线']
    },
    'refute': {
        'vt.': ['反驳，驳斥']
    },
    'antecede': {
        'vt.': ['居先', '（地位上）高于']
    },
    'conducive': {
        'a.': ['有助于...的，有益于...的']
    },
    'deem': {
        'vt.': ['认为，相信']
    },
    'ripple': {
        'n.': ['细浪，涟漪'],
        'v.': ['起涟漪', '扩散']
    },
    'urbanization': {
        'n.': ['都市化']
    },
    'slash': {
        'v.': ['砍', '大幅消减'],
        'n.': ['砍痕，伤痕', '斜线号']
    },
    'elite': {
        'a.': ['卓越的，精锐的'],
        'n.': ['精英']
    },
    'abolish': {
        'vt.': ['废止，废除']
    },
    'breach': {
        'n.': ['违背', '破裂', '缺口'],
        'vt.': ['打破', '违反']
    },
    'derive': {
        'v.': ['取得', '起源']
    },
    'pupil': {
        'n.': ['小学生', '瞳孔']
    },
    'condole': {
        'vi.': ['向...吊唁', '慰问']
    },
    'altruistic': {
        'a.': ['利他的，无私心的，为他人着想的']
    },
    'grill': {
        'vt.': ['烧烤', '拷问，盘问'],
        'n.': ['烤架']
    },
    'saddle': {
        'n.': ['马鞍', '（自行车的）车座'],
        'vt.': ['给...备鞍']
    },
    'paralyze': {
        'vt.': ['使瘫痪，使麻痹', '使无效']
    },
    'disintegrate': {
        'v.': ['（使）瓦解', '（使）碎裂']
    },
    'tenuous': {
        'a.': ['纤细的', '稀薄的', '脆弱的']
    },
    'activate': {
        'vt.': ['刺激，使活动']
    },
    'occasional': {
        'a.': ['偶然的，不经常的', '临时的']
    },
    'court': {
        'n.': ['法院，法庭', '宫廷，朝廷', '球场'],
        'vt.': ['献殷情，讨好', '招致', '求爱']
    },
    'scene': {
        'n.': ['地点，现场', '景色', '（戏剧的）一场，（电影、电视的）一个镜头', '场面', '活动领域，圈子']
    },
    'inconvenient': {
        'a.': ['不便的', '让人不舒服的']
    },
    'passion': {
        'n.': ['激情，热情']
    },
    'incompatible': {
        'a.': ['不兼容的', '不协调的，合不来的']
    },
    'metropolis': {
        'n.': ['首府', '大都市']
    },
    'expose': {
        'vt.': ['暴露，显露', '揭露，揭穿', '使接触，使面临']
    },
    'register': {
        'v./n.': ['登记，注册']
    },
    'deter': {
        'v.': ['威慑，阻止']
    },
    'occur': {
        'vi.': ['发生，出现', '存在于']
    },
    'enterprise': {
        'n.': ['企业，公司', '事业']
    },
    'chaos': {
        'n.': ['混乱']
    },
    'violent': {
        'a.': ['暴力的', '感情强烈的，激情的', '强烈的，激烈的']
    },
    'homogeneous': {
        'a.': ['同类的，相似的，同质的']
    },
    'boundary': {
        'n.': ['分界线', '边界']
    },
    'male': {
        'a.': ['雄的，公的', '男性的'],
        'n.': ['男子', '雄性动（或植）物']
    },
    'sheath': {
        'n.': ['鞘，外壳', '（工具的）套', '（电线等的）护皮', '紧身连衣裙']
    },
    'appointment': {
        'n.': ['约会，约定', '任命，委派', '职位']
    },
    'exhilarating': {
        'a.': ['令人高兴的，使人兴奋的']
    },
    'fabricate': {
        'vt.': ['编造', '制造']
    },
    'artistic': {
        'a.': ['艺术（家）的', '富有艺术性的，精美的', '有艺术天赋的']
    },
    'keen': {
        'a.': ['灵敏的，敏锐的', '热心的，渴望的', '激烈的', '锋利的']
    },
    'seismology': {
        'n.': ['地震学']
    },
    'welfare': {
        'n.': ['福利', '安宁，幸福']
    },
    'gross': {
        'vt.': ['总收入为'],
        'a.': ['总的，毛的', '粗俗的，粗野的', '令人不快的'],
        'n.': ['一罗（为12打，144个）', '毛收入，总收入']
    },
    'edge': {
        'n.': ['边，边缘', '刀口，刃', '优势'],
        'v.': ['（使）徐徐移动', '略微增加', '给...加边']
    },
    'revert': {
        'v.': ['恢复（原状）', '（财产、权利等）归还，归属']
    },
    'appliance': {
        'n.': ['用具，器具', '装置']
    },
    'slender': {
        'a.': ['细长的', '苗条的，纤细的', '微薄的，不足的']
    },
    'noxious': {
        'a.': ['有害的', '有毒的']
    },
    'calendar': {
        'n.': ['日历，挂历，月历', '日程表']
    },
    'quiz': {
        'n.': ['小测验', '智力竞赛'],
        'vt.': ['测验', '盘问，查问，询问']
    },
    'universe': {
        'n.': ['宇宙', '世界']
    },
    'agreeable': {
        'a.': ['使人愉快的', '欣然同意的']
    },
    'grant': {
        'v.': ['给予，授予', '允许，同意', '承认'],
        'n.': ['拨款', '津贴', '授予物']
    },
    'perception': {
        'n.': ['感知，感觉', '认识，观念', '洞察力']
    },
    'ethic': {
        'n.': ['道德规范，道德准则', '伦理学']
    },
    'maglev': {
        'n.': ['磁力悬浮火车']
    },
    'cosmic': {
        'a.': ['宇宙的', '无限的']
    },
    'anchor': {
        'v.': ['抛锚', '使固定', '（使）扎根，（使）基于', '主持（电池、广播节目等）'],
        'n.': ['锚', '给人安全感的物（或人），精神支柱']
    },
    'engineering': {
        'n.': ['工程', '工程学']
    },
    'crew': {
        'n.': ['全体船员', '全体工作人员']
    },
    'delay': {
        'v.': ['耽搁，延迟'],
        'n.': ['耽搁，延迟']
    },
    'halt': {
        'n.': ['停止，阻止', '暂停'],
        'v.': ['（使）停住，停下']
    },
    'staple': {
        'n.': ['主要产品', '原材料', '主食', '订书钉'],
        'a.': ['主要的'],
        'vt.': ['把...订起来']
    },
    'vibrate': {
        'v.': ['（使）颤动，（使）震动']
    },
    'champion': {
        'n.': ['冠军', '拥护者'],
        'vt.': ['声援']
    },
    'stimulus': {
        'n.': ['刺激（物），激励，促进因素']
    },
    'attempt': {
        'n./vi.': ['尝试', '努力']
    },
    'mercury': {
        'n.': ['水星', '水银，汞']
    },
    'fragrant': {
        'a.': ['芬芳的，香的']
    },
    'scar': {
        'vt.': ['给...留下伤疤', '给...留下精神创伤', '损害...的外观'],
        'n.': ['疤痕', '创伤']
    },
    'log': {
        'n.': ['原木，木材', '日志，（尤指）航海日志，飞行日志'],
        'vt.': ['记录', '伐木']
    },
    'stir': {
        'v.': ['搅拌', '煽动', '激发，打动', '（使）行动，活动'],
        'n.': ['搅拌，搅动', '激动，震动']
    },
    'refer': {
        'v.': ['提到，谈及', '查阅，参考']
    },
    'enthusiasm': {
        'n.': ['热情', '积极性', '热衷的事物']
    }
}
