#!/usr/bin/env python3
# -*- coding: utf-8 -*-

L = {
    'yeast': {
        'n.': ['酵母，发酵粉']
    },
    'wreck': {
        'vt.': ['使失事', '破坏'],
        'n.': ['沉船', '失事']
    },
    'incinerate': {
        'vt.': ['焚化，焚毁']
    },
    'scope': {
        'n.': ['范围，界限', '眼界，见识', '（发挥能力等的）余地，机会']
    },
    'intrude': {
        'vi.': ['侵入，闯入', '打扰，侵扰']
    },
    'bronze': {
        'n.': ['青铜', '青铜色', '青铜制品', '铜牌'],
        'a.': ['青铜色的']
    },
    'topsoil': {
        'n.': ['表层土']
    },
    'acquaint': {
        'vt.': ['使认识', '使熟悉']
    },
    'bake': {
        'v.': ['烘，烤，培']
    },
    'submerge': {
        'v.': ['浸没，淹没']
    },
    'emblem': {
        'n.': ['徽章', '标记，象征']
    },
    'breed': {
        'n.': ['品种'],
        'v.': ['饲养', '繁殖', '养育', '酿成，导致']
    },
    'tributary': {
        'n.': ['支流', '进贡者'],
        'a.': ['支流的', '进贡的', '辅助的']
    },
    'sound': {
        'a.': ['可靠的', '健康的，完好无损的', '合理的'],
        'v.': ['似乎', '测量...的深度']
    },
    'malicious': {
        'a.': ['怀有恶意的，恶毒的']
    },
    'equal': {
        'vt.': ['等于', '相当于'],
        'a.': ['相同的'],
        'n.': ['相等的人', '相等的事物']
    },
    'inevitably': {
        'ad.': ['不可避免地，必然地']
    },
    'pulp': {
        'vt.': ['使成浆状'],
        'n.': ['纸浆', '浆状物']
    },
    'naked': {
        'a.': ['裸露的，无遮盖的', '直白的，露骨的，不加掩饰的']
    },
    'refrain': {
        'n.': ['反复句，副歌'],
        'v.': ['抑制', '戒除']
    },
    'disclose': {
        'vt.': ['泄露，透露', '揭发']
    },
    'retract': {
        'v.': ['收回，撤销', '缩回']
    },
    'indolent': {
        'a.': ['慵懒的，懒散的', '不活跃的']
    },
    'allure': {
        'n./v.': ['诱惑，吸引']
    },
    'widespread': {
        'a.': ['分布广泛的，普遍的']
    },
    'dissolute': {
        'a.': ['放荡的，放纵的，道德沦丧的']
    },
    'interpret': {
        'v.': ['解释，说明', '理解', '翻译']
    },
    'slacken': {
        'v.': ['（使）松弛，（使）放松', '（使）减缓，放慢']
    },
    'biannual': {
        'a.': ['一年两次的']
    },
    'prophet': {
        'n.': ['先知', '预言者', '拥护者，鼓吹者']
    },
    'mainstream': {
        'n.': ['主流，主要倾向', '主流思想']
    },
    'obligate': {
        'vt.': ['使负义务，强迫']
    },
    'rip': {
        'v.': ['扯破，撕坏'],
        'n.': ['裂口，裂缝']
    },
    'code': {
        'vt.': ['编纂（法典等）', '把...编码'],
        'n.': ['法典，法规', '密码，代码']
    },
    'scoff': {
        'vi.': ['嘲笑，讥笑']
    },
    'oppressive': {
        'a.': ['压迫的，压制的', '令人焦虑的']
    },
    'impede': {
        'vt.': ['妨碍，阻碍，阻止']
    },
    'endanger': {
        'vt.': ['危机，危害']
    },
    'intermediate': {
        'a.': ['中间的', '中级的'],
        'n.': ['中间体，媒介']
    },
    'scornful': {
        'a.': ['轻蔑的，鄙视的']
    },
    'chip': {
        'v.': ['削（或凿）下'],
        'n.': ['碎片', '芯片']
    },
    'imbibe': {
        'v.': ['喝', '吸收，接受（信息等）']
    },
    'prospect': {
        'n.': ['前景，前途', '可能性', '景象', '期望'],
        'v.': ['勘探，勘查']
    },
    'mass': {
        'n.': ['质量', '块，团', '众多', '群众，平民百姓'],
        'a.': ['大量的']
    },
    'alkali': {
        'n.': ['碱']
    },
    'unearth': {
        'vt.': ['掘出，发掘', '揭露']
    },
    'suffragist': {
        'n.': ['妇女政权论者']
    },
    'amusement': {
        'n.': ['可笑', '娱乐，消遣']
    },
    'pharmacy': {
        'n.': ['药店', '药剂学']
    },
    'shallow': {
        'a.': ['浅的', '浅薄的'],
        'n.': ['浅滩，浅水处']
    },
    'casual': {
        'a.': ['非正式的，随便的', '漫不经心的', '漠不关心的，冷淡的', '偶然的，碰巧的', '临时的']
    },
    'irresistible': {
        'a.': ['无法抗拒的，诱人的', '不能自已的']
    },
    'sprawl': {
        'vi.': ['伸开四肢坐（或躺）', '扩展，蔓延'],
        'n.': ['扩展，蔓延', '蔓延物']
    },
    'rival': {
        'vt.': ['与...相匹敌，比得上'],
        'n.': ['竞争对手'],
        'a.': ['竞争的，对抗的']
    },
    'monarch': {
        'n.': ['君主，帝王']
    },
    'faint': {
        'a.': ['模糊的，不清楚的', '无力的，虚弱的', '眩晕的'],
        'vi.': ['昏厥，晕倒'],
        'n.': ['昏厥']
    },
    'criterion': {
        'n.': ['标准，准则']
    },
    'epidemic': {
        'n.': ['流行', '流行病'],
        'a.': ['流行性的，传染性的']
    },
    'joint': {
        'n.': ['关节，骨节', '接头，接合处'],
        'a.': ['连接的', '共同的，共有的，联合的']
    },
    'convict': {
        'vt.': ['定罪，宣告...有罪'],
        'n.': ['服刑囚犯']
    },
    'debris': {
        'n.': ['岩屑', '残骸', '碎屑']
    },
    'permanent': {
        'a.': ['持久的，永久的', '固定不变的']
    },
    'annex': {
        'vt.': ['兼并', '附加']
    },
    'draft': {
        'n.': ['草图，草稿', '汇票', '气流'],
        'vt.': ['起草', '征募，选派'],
        'a.': ['供役使的']
    },
    'soccer': {
        'n.': ['足球']
    },
    'prominent': {
        'a.': ['卓著的，杰出的', '突起的，凸出的']
    },
    'ore': {
        'n.': ['矿', '矿物，矿石']
    },
    'accommodate': {
        'v.': ['提供（住宿、座位等）', '容纳', '（使）适应，顺应']
    },
    'display': {
        'vt./n.': ['陈列', '展示', '显示']
    },
    'refine': {
        'vt.': ['精炼，精制', '使完善', '净化，提纯']
    },
    'cumbersome': {
        'a.': ['笨重的', '麻烦的', '累赘的，冗长的']
    },
    'gentility': {
        'n.': ['有教养，文雅']
    },
    'stagecoach': {
        'n.': ['公共马车，驿站马车']
    },
    'despoil': {
        'vt.': ['夺取，掠夺', '蹂躏']
    },
    'folklore': {
        'n.': ['民间传说', '民俗学']
    },
    'glacial': {
        'a.': ['冰川期的，冰河时代的', '寒冷的，冰冷的', '冷若冰霜的']
    },
    'microscope': {
        'n.': ['显微镜']
    },
    'beat': {
        'v.': ['打拍子，指挥', '敲打', '打败，胜过', '（心脏等）跳动'],
        'n.': ['（心脏等的）跳动（声）', '节拍，节奏', '有规律的敲击（声）'],
        'a.': ['疲惫的']
    },
    'disorder': {
        'n.': ['混乱，凌乱', '动乱，骚乱', '失调，紊乱']
    },
    'spinet': {
        'n.': ['小型立式钢琴']
    },
    'consume': {
        'vt.': ['消耗，损耗', '消费', '吃，喝', '使充满', '烧毁，毁灭']
    },
    'besides': {
        'prep.': ['除...之外'],
        'ad.': ['而且，还有']
    },
    'affect': {
        'vt.': ['影响', '感染']
    },
    'libel': {
        'vt.': ['诽谤'],
        'n.': ['（文字）诽谤', '诽谤性文字']
    },
    'ethnic': {
        'a.': ['种族的', '民族的']
    },
    'fitness': {
        'n.': ['健康，健壮', '适合（某事物或做某事）']
    },
    'lax': {
        'a.': ['懒散的', '不严格的，马虎的']
    },
    'evacuation': {
        'n.': ['撤离']
    },
    'quaint': {
        'a.': ['古色古香的', '离奇有趣的']
    },
    'pamphlet': {
        'n.': ['小册子']
    },
    'predominant': {
        'a.': ['占优势的，主导的，支配的', '显著的，盛行的']
    },
    'concentrate': {
        'v.': ['集中（注意力），专心', '（使）浓缩'],
        'n.': ['浓缩物']
    }
}
