#!/usr/bin/env python3
# -*- coding: utf-8 -*-

L = {
    'systematic': {
        'a.': ['系统的，体系的']
    },
    'client': {
        'n.': ['委托人，当事人', '顾客']
    },
    'dye': {
        'n.': ['颜料，染料'],
        'v.': ['染色']
    },
    'turtle': {
        'n.': ['龟，海龟']
    },
    'finance': {
        'vt.': ['给...提供资金'],
        'n.': ['财政，金融', '财务情况']
    },
    'supervise': {
        'vt.': ['监督', '指导']
    },
    'tariff': {
        'n.': ['关税', '（旅馆、饭店等的）价目表，收费表']
    },
    'copious': {
        'a.': ['丰富的，富饶的']
    },
    'exposure': {
        'n.': ['暴露，显露', '揭露', '曝光', '面临，遭受（危险或不快）']
    },
    'substance': {
        'n.': ['物质', '主旨，实质', '根据', '重要性']
    },
    'neoclassical': {
        'a.': ['新古典主义的']
    },
    'array': {
        'n.': ['一系列', '阵列'],
        'vt.': ['布置，排列', '部署']
    },
    'counselor': {
        'n.': ['（尤指针对私人问题的）顾问', '律师']
    },
    'sanction': {
        'vt.': ['同意，许可', '惩罚，实施制裁'],
        'n.': ['同意，许可', '约束', '制裁']
    },
    'enhance': {
        'vt.': ['提高', '增强']
    },
    'overact': {
        'v.': ['把（角色）表演得过火', '表现做作']
    },
    'append': {
        'vt.': ['附加，增补']
    },
    'chilly': {
        'a.': ['寒冷的', '冷淡的，不友好的']
    },
    'retrospect': {
        'n.': ['回顾，反顾']
    },
    'havoc': {
        'n.': ['混乱，大破坏']
    },
    'apprehend': {
        'vt.': ['逮捕', '领会，理解']
    },
    'sacrifice': {
        'v.': ['牺牲，献出', '以...做祭献'],
        'n.': ['牺牲，献身', '献祭，祭品']
    },
    'evacuate': {
        'v.': ['疏散，撤离', '排空']
    },
    'bilingualism': {
        'n.': ['双语现象']
    },
    'tentative': {
        'a.': ['实验性的', '不确定的，暂定的', '犹豫的']
    },
    'zest': {
        'n.': ['趣味', '热情，狂热']
    },
    'agonize': {
        'vi.': ['苦苦思索', '焦虑不已']
    },
    'etiquette': {
        'n.': ['礼节，礼仪']
    },
    'disinterest': {
        'n.': ['无兴趣，冷漠', '客观，公正']
    },
    'stipulate': {
        'v.': ['规定，明确要求', '（以...为条件）约定']
    },
    'oratorio': {
        'n.': ['清唱剧，宗教剧']
    },
    'adamant': {
        'a.': ['坚定不移的，坚决的', '固执的']
    },
    'discredit': {
        'vt.': ['使丧失声誉', '使怀疑'],
        'n.': ['名誉丧失']
    },
    'morgue': {
        'n.': ['停尸房，太平间']
    },
    'democracy': {
        'n.': ['民主政体，民主制度', '民主国家', '民主精神']
    },
    'coral': {
        'n.': ['珊瑚（虫）'],
        'a.': ['珊瑚色的，红色的']
    },
    'pheromone': {
        'n.': ['信息素']
    },
    'ornament': {
        'n.': ['装饰（品）'],
        'vt.': ['装饰，点缀']
    },
    'deport': {
        'vt.': ['驱逐出境']
    },
    'outgas': {
        'vt.': ['除去（固体中的）气']
    },
    'chaste': {
        'a.': ['贞洁的', '简朴的，朴实的']
    },
    'tract': {
        'n.': ['地域', '领域', '传单，小册子', '大片（土地或森林）']
    },
    'cipher': {
        'n.': ['密码，暗号']
    },
    'soloist': {
        'n.': ['独奏者，独唱者，单独表演者']
    },
    'purity': {
        'n.': ['纯度', '纯洁，纯净，纯粹']
    },
    'notwithstanding': {
        'ad./prep.': ['虽然，尽管如此']
    },
    'seem': {
        'v.': ['好像，似乎']
    },
    'protagonist': {
        'n.': ['（戏剧、故事、小说中的）主角，主人公', '领导者，倡导者']
    },
    'recruit': {
        'v.': ['招募（新兵），征募'],
        'n.': ['新兵', '新成员']
    },
    'supplant': {
        'vt.': ['取代，代替']
    },
    'prolonged': {
        'a.': ['长期的，持久的']
    },
    'bet': {
        'n.': ['打赌', '赌注'],
        'v.': ['打赌', '敢说，确信']
    },
    'physical': {
        'a.': ['物理（学）的', '物质的，有形的', '身体的，肉体的'],
        'n.': ['体检']
    },
    'incursion': {
        'n.': ['袭击，突然入侵', '介入']
    },
    'metric': {
        'a.': ['米制的', '公制的']
    },
    'transplant': {
        'vt.': ['移植（器官等）', '使迁移，使移居', '移栽，移种（植物等）'],
        'n.': ['（器官等的）移植']
    },
    'fresco': {
        'n.': ['湿壁画', '湿壁画技法'],
        'v.': ['绘湿壁画于']
    },
    'mission': {
        'n.': ['代表团，使团', '任务，使命']
    },
    'expansion': {
        'n.': ['扩张', '膨胀']
    },
    'spray': {
        'n.': ['浪花', '飞沫', '喷雾'],
        'v.': ['喷射', '（使）溅散']
    },
    'tectonics': {
        'n.': ['构造地质学']
    },
    'assign': {
        'vt.': ['指派', '指定（时间、地点等）', '分配', '布置（作业）']
    },
    'swell': {
        'v.': ['（使）增加，扩大', '膨胀，肿胀'],
        'n.': ['波浪的涌动', '隆起（处）', '增强，增加']
    },
    'outlying': {
        'a.': ['边远的，偏僻的', '无关的，题外的']
    },
    'blink': {
        'v.': ['眨眼睛', '闪亮，闪烁'],
        'n.': ['眨眼睛']
    },
    'dialect': {
        'n.': ['方言，土话']
    },
    'shortly': {
        'ad.': ['不久', '简要地', '不耐烦地']
    },
    'applaud': {
        'v.': ['鼓掌，喝彩', '称赞']
    },
    'larva': {
        'n.': ['幼虫，幼体']
    },
    'monastery': {
        'n.': ['男修道院，寺院']
    },
    'bluff': {
        'n.': ['悬崖，峭壁', '虚张声势，唬人'],
        'v.': ['虚张声势，吓唬'],
        'a.': ['直率地，坦率的']
    },
    'facet': {
        'n.': ['（宝石的）小平面', '（问题等的）方面']
    },
    'primal': {
        'a.': ['最初的', '主要的，首要的']
    },
    'accomplishment': {
        'n.': ['成就', '完成', '才艺，技艺']
    },
    'longevity': {
        'n.': ['长寿', '寿命']
    },
    'revolt': {
        'v.': ['反叛，反抗', '违抗', '（使）厌恶，（使）反感'],
        'n.': ['起义，叛乱，反抗']
    },
    'subsistence': {
        'n.': ['生存，生计']
    },
    'ceremonial': {
        'a.': ['礼仪的，礼节的'],
        'n.': ['礼仪，礼节']
    },
    'seasoning': {
        'n.': ['调味品，调料']
    },
    'abreast': {
        'ad.': ['并列地，并排地']
    },
    'pioneer': {
        'vt.': ['开拓，开创'],
        'n.': ['开拓者，创始人']
    },
    'division': {
        'n.': ['除，除法', '分开，分隔', '分配', '（分出来的）部分', '分歧、分裂', '部门']
    },
    'horn': {
        'n.': ['（牛、羊、鹿等的）角', '号角，喇叭']
    },
    'fix': {
        'v.': ['修理', '使固定，安装', '安排', '找到，确定'],
        'n.': ['解决方法', '困境，窘境']
    },
    'ecological': {
        'a.': ['生态（学）的']
    },
    'label': {
        'vt.': ['标记'],
        'n.': ['标签', '称号']
    },
    'displace': {
        'vt.': ['取代', '撤职', '迫使...离开家园']
    },
    'appropriate': {
        'vt.': ['拨款', '占用，挪用'],
        'a.': ['适当的']
    },
    'scientific': {
        'a.': ['科学（上）的', '细致严谨的']
    },
    'wear': {
        'v.': ['穿，戴', '留（须、发等）', '面露，面带', '磨损，用旧'],
        'n.': ['穿戴，衣着', '服装，穿戴物', '磨损，损坏']
    }
}
