#!/usr/bin/env python3
# -*- coding: utf-8 -*-

L = {
    'interior': {
        'a.': ['内部的', '内地的'],
        'n.': ['内陆']
    },
    'constitution': {
        'n.': ['宪法，章程', '体质', '构成']
    },
    'freeze': {
        'v.': ['（使）结冰，（使）凝固']
    },
    'dehydrate': {
        'v.': ['（使）脱水']
    },
    'sinuous': {
        'a.': ['蜿蜒的', '迂回的']
    },
    'alarm': {
        'n.': ['闹钟', '警报'],
        'vt.': ['使惊恐', '使担心']
    },
    'machinery': {
        'n.': ['<总成>机器，机械', '机构']
    },
    'expect': {
        'v.': ['预期，期望，指望']
    },
    'anticipate': {
        'v.': ['预见，预期', '先于...行动']
    },
    'critic': {
        'n.': ['评论家，批评家', '吹毛求疵者']
    },
    'instinctual': {
        'a.': ['本能的']
    },
    'uncanny': {
        'a.': ['神秘的', '异乎寻常的']
    },
    'arrest': {
        'n./vt.': ['逮捕，拘留', '停止，阻止', '吸引']
    },
    'sprinkle': {
        'v.': ['撒，洒，喷'],
        'n.': ['少量']
    },
    'orthodox': {
        'a.': ['传统的', '正统的']
    },
    'preliterate': {
        'a.': ['文字出现以前的，没有文字的']
    },
    'nominal': {
        'a.': ['名义上的', '（费用等）微不足道的']
    },
    'certitude': {
        'n.': ['确定，确信', '必然性']
    },
    'hustle': {
        'n.': ['忙碌'],
        'vt.': ['猛推', '催促']
    },
    'fake': {
        'a.': ['冒充'],
        'n.': ['假货', '骗子'],
        'v.': ['伪造', '伪装']
    },
    'engrave': {
        'vt.': ['（在...上）雕刻', '铭刻']
    },
    'prohibit': {
        'v.': ['禁止，阻止']
    },
    'homage': {
        'n.': ['尊敬，敬意']
    },
    'dramatize': {
        'v.': ['改编成戏剧', '（使）戏剧化，戏剧性地表现']
    },
    'infatuate': {
        'vt.': ['使迷恋', '使糊涂']
    },
    'exclusive': {
        'a.': ['独占的', '除外的，排他的', '奢华的'],
        'n.': ['独家新闻']
    },
    'cynical': {
        'a.': ['愤世嫉俗的，冷嘲热讽的']
    },
    'discriminate': {
        'v.': ['区别', '歧视']
    },
    'associate': {
        'v.': ['结交', '关联'],
        'a.': ['副的', '合伙的'],
        'n.': ['伙伴']
    },
    'spare': {
        'vt.': ['抽出（时间等）', '免除'],
        'a.': ['备用的', '空闲的'],
        'n.': ['备用品']
    },
    'database': {
        'n.': ['数据库']
    },
    'proclaim': {
        'v.': ['宣布，声明', '显示']
    },
    'level': {
        'n.': ['水平', '高度', '级别'],
        'a.': ['平坦的', '高等的'],
        'vt.': ['夷平，使平坦']
    },
    'controversy': {
        'n.': ['争论，辩论']
    },
    'oppose': {
        'v.': ['反对，对抗']
    },
    'toxic': {
        'a.': ['有毒的', '中毒的']
    },
    'lead': {
        'v.': ['领导，引导', '领先，占首位', '通向，导致，引起'],
        'n.': ['带领，引导']
    },
    'rustproof': {
        'a.': ['不锈的']
    },
    'sunlit': {
        'a.': ['阳光照射的']
    },
    'profession': {
        'n.': ['职业', '同行', '专业', '宣称']
    },
    'hay': {
        'n.': ['干草']
    },
    'vegetarian': {
        'n.': ['素食者'],
        'a.': ['素食者的']
    },
    'column': {
        'n.': ['专栏（文章）', '圆柱，支柱', '纵队']
    },
    'microbe': {
        'n.': ['微生物，细菌']
    },
    'homestead': {
        'n.': ['家宅，农庄', '宅地']
    },
    'canyon': {
        'n.': ['峡谷']
    },
    'portraiture': {
        'n.': ['画像技法', '肖像，画像']
    },
    'alloy': {
        'n.': ['合金'],
        'vt.': ['使合成金']
    },
    'microscopic': {
        'a.': ['用显微镜可见的', '极小的']
    },
    'verse': {
        'n.': ['诗歌', '韵文', '诗节']
    },
    'credential': {
        'n.': ['证书', '文凭', '资格']
    },
    'towering': {
        'a.': ['高耸的', '杰出的']
    },
    'pervasive': {
        'a.': ['普遍深入的', '遍及的，弥漫的']
    },
    'lush': {
        'a.': ['茂盛的']
    },
    'igneous': {
        'a.': ['火的，似火的', '火成的，火成岩的']
    },
    'salient': {
        'a.': ['显著的，突出的']
    },
    'rescue': {
        'vt./n.': ['营救，搭救']
    },
    'acquire': {
        'vt.': ['获得，取得']
    },
    'geometry': {
        'n.': ['几何，几何学']
    },
    'inner': {
        'a.': ['内部的', '内心的'],
        'n.': ['内部', '内心']
    },
    'combine': {
        'v.': ['（使）联合，（使）结合']
    },
    'shrivel': {
        'v.': ['（使）枯萎']
    },
    'infancy': {
        'n.': ['幼年', '（发展或生长的）初期']
    },
    'syrup': {
        'n.': ['糖浆']
    },
    'hemp': {
        'n.': ['大麻（纤维）', '由大麻制成的麻醉药']
    },
    'ethical': {
        'a.': ['道德的']
    },
    'weed': {
        'n.': ['杂草', '水草']
    },
    'trend': {
        'n.': ['趋势，倾向']
    },
    'motivate': {
        'vt.': ['激励', '激发']
    },
    'dilate': {
        'v.': ['（使）膨胀，扩大', '详述']
    },
    'peak': {
        'a.': ['最高的，高峰的'],
        'n.': ['最高点，顶峰']
    },
    'homing': {
        'a.': ['有返回原地本能的']
    },
    'flagellum': {
        'n.': ['鞭毛']
    },
    'intricate': {
        'a.': ['错综复杂的']
    },
    'tournament': {
        'n.': ['比赛', '竞标赛']
    },
    'advocate': {
        'vt.': ['提倡'],
        'n.': ['提倡者']
    },
    'crush': {
        'vt.': ['碾碎', '使变形', '镇压']
    },
    'ingredient': {
        'n.': ['成分，要素', '（烹饪的）原料']
    },
    'terminal': {
        'n.': ['终点站', '终点', '航站楼'],
        'a.': ['末端的']
    },
    'rub': {
        'n./v.': ['擦，摩擦']
    },
    'mighty': {
        'a.': ['强有力的', '巨大的']
    },
    'accident': {
        'n.': ['意外事件，事故']
    },
    'inflammation': {
        'n.': ['炎症，发炎']
    },
    'shield': {
        'n.': ['防护物', '盾'],
        'vt.': ['保护']
    },
    'mammoth': {
        'a.': ['巨大的'],
        'n.': ['猛犸，毛象']
    },
    'nightmare': {
        'n.': ['噩梦', '无法摆脱的恐惧', '可怕的事']
    },
    'accord': {
        'n.': ['协议，条约'],
        'v.': ['与...一致，符合']
    },
    'versus': {
        'prep.': ['对，对抗', '与...相对，与...相比']
    },
    'musician': {
        'n.': ['音乐家，乐师']
    }
}
