#!/usr/bin/env python3
# -*- coding: utf-8 -*-

L = {
    'dwarf': {
        'vt.': ['使显得矮小，使相形见拙'],
        'a.': ['矮小的'],
        'n.': ['侏儒，矮人']
    },
    'classic': {
        'a.': ['经典的', '典型的'],
        'n.': ['经典作品', '古典文学']
    },
    'muggy': {
        'a.': ['（天气）闷热的']
    },
    'skyscraper': {
        'n.': ['摩天楼']
    },
    'compliment': {
        'vt.': ['赞美，称赞'],
        'n.': ['赞美', '问候'],
    },
    'pest': {
        'n.': ['害虫', '令人讨厌的人（或物）']
    },
    'genius': {
        'n.': ['天才', '天赋']
    },
    'repute': {
        'v.': ['（被）称为，认为'],
        'n.': ['名声，名誉']
    },
    'fauna': {
        'n.': ['动物群']
    },
    'healthful': {
        'a.': ['有益健康的']
    },
    'sympathetic': {
        'a.': ['感应的，交感的', '有同情心的', '体谅的']
    },
    'mortality': {
        'n.': ['死亡率']
    },
    'wanna': {
        'v.': ['想要']
    },
    'predecessor': {
        'n.': ['前辈', '前辈', '（被取代的）原有食物']
    },
    'scrub': {
        'v.': ['擦洗', '取消（计划等）'],
        'n.': ['灌木丛', '丛林地带']
    },
    'check': {
        'n.': ['支票', '账单', '检查'],
        'v.': ['检查', '制止']
    },
    'dive': {
        'vi./n.': ['跳水', '潜水']
    },
    'rough': {
        'a.': ['粗糙不平的', '粗暴的', '艰难的'],
        'n.': ['高低不平的地面']
    },
    'stain': {
        'v.': ['沾污', '留下污渍'],
        'n.': ['污点， 污渍']
    },
    'multiple': {
        'a.': ['多样的', '多重的'],
        'n.': ['倍数']
    },
    'visual': {
        'a.': ['视觉的']
    },
    'rationality': {
        'n.': ['理性', '合理性']
    },
    'tout': {
        'v.': ['吹捧', '兜售']
    },
    'stubborn': {
        'a.': ['顽固的，倔强的', '难对付的']
    },
    'outrage': {
        'n.': ['暴行', '愤慨'],
        'vt.': ['激怒']
    },
    'intrigue': {
        'n.': ['阴谋，诡计'],
        'v.': ['密谋', '迷住']
    },
    'connote': {
        'v.': ['意味着', '暗示']
    },
    'persistent': {
        'a.': ['坚持的，百折不饶的', '持续的']
    },
    'secede': {
        'vi.': ['正式脱离，退出（组织等）']
    },
    'disquiet': {
        'v.': ['（使）不安，（使）忧虑'],
        'n.': ['不安', '忧虑']
    },
    'bode': {
        'vi': ['预示']
    },
    'folkway': {
        'n.': ['社会风俗']
    },
    'console': {
        'vt.': ['安慰，抚慰']
    },
    'overrun': {
        'v.': ['超过，溢出', '泛滥', '横行'],
        'n.': ['泛滥', '超出的部分']
    },
    'turmoil': {
        'n.': ['骚动，混乱', '焦虑']
    },
    'amenable': {
        'a.': ['服从的，服从劝导的', '有服从义务的']
    },
    'interrelate': {
        'v.': ['（使）互相关联，紧密联系']
    },
    'nude': {
        'a.': ['裸体的']
    },
    'redundant': {
        'a.': ['多余的', '累赘的']
    },
    'inverse': {
        'a.': ['相反的，反向的'],
        'n.': ['反面', '倒数']
    },
    'revive': {
        'v.': ['恢复', '（使）苏醒', '重新利用']
    },
    'insulin': {
        'n.': ['胰岛素']
    },
    'explore': {
        'v.': ['探索，勘探', '探险', '探究']
    },
    'cart': {
        'n.': ['运货马车', '手推车'],
        'vt.': ['用车装运']
    },
    'pertinent': {
        'a.': ['相关的', '恰当的，贴切的']
    },
    'mercy': {
        'n.': ['宽恕', '仁慈', '恩惠，幸运']
    },
    'rebellious': {
        'a.': ['反叛的，叛逆的', '叛乱的']
    },
    'barrel': {
        'n.': ['桶']
    },
    'transition': {
        'n.': ['过度，过渡时期', '转变']
    },
    'lyric': {
        'a.': ['抒情的'],
        'n.': ['抒情诗', '歌词']
    },
    'adorn': {
        'vt.': ['装饰，装扮']
    },
    'questionnaire': {
        'n.': ['问卷，调查表']
    },
    'minority': {
        'n.': ['少数', '少数民族']
    },
    'entitle': {
        'vt.': ['使...有权', '给（书等）题名']
    },
    'renew': {
        'vt.': ['使...续期', '重新开始', '重申', '修复']
    },
    'consistent': {
        'a.': ['一致的', '稳定的', '调和的', '始终如一的']
    },
    'quotation': {
        'n.': ['引文，引语，语录', '报价']
    },
    'so-called': {
        'a.': ['所谓的']
    },
    'magnitude': {
        'n.': ['巨大', '重要性', '星等，星球的亮度']
    },
    'rectangle': {
        'n.': ['长方形，矩形']
    },
    'telescope': {
        'n.': ['望远镜']
    },
    'lightning': {
        'n.': ['闪电'],
        'a.': ['闪电般地，快速的']
    },
    'utensil': {
        'n.': ['（家庭）用具', '器皿']
    },
    'kennel': {
        'n.': ['狗窝', '养狗场']
    },
    'liquid': {
        'a.': ['液体的，液态的，流体的', '清澈的', '流畅的'],
        'n.': ['液体', '液态']
    },
    'remark': {
        'v.': ['评论', '谈论', '察觉'],
        'n.': ['评论，评语', '注释']
    },
    'principal': {
        'a.': ['主要的，最重要的'],
        'n.': ['校长', '资本', '主角']
    },
    'hide': {
        'v.': ['躲藏', '掩藏', '掩盖'],
        'n.': ['兽皮']
    },
    'spoil': {
        'v.': ['破坏', '宠坏，溺爱', '变质']
    },
    'internship': {
        'n.': ['实习期']
    },
    'polish': {
        'v.': ['磨光，擦亮', '修改，润色'],
        'n.': ['上光剂']
    },
    'starch': {
        'n.': ['淀粉', '淀粉类食品']
    },
    'assimilation': {
        'n.': ['同化', '吸收']
    },
    'detest': {
        'v.': ['憎恶']
    },
    'gigantic': {
        'a.': ['巨大的，庞大的']
    },
    'convention': {
        'n.': ['（正式）会议', '习俗，惯例', '公约']
    },
    'diagonal': {
        'a.': ['斜线的，对角线的'],
        'n.': ['斜线，对角线']
    },
    'absenteeism': {
        'n.': ['旷课', '旷工']
    },
    'bacon': {
        'n.': ['咸肉，熏肉']
    },
    'silversmith': {
        'n.': ['银匠', '银器商人']
    },
    'cell': {
        'n.': ['细胞', '基层组织', '单人房间', '电池']
    },
    'digression': {
        'n.': ['离题，扯到枝节上', '题外话，枝节内容']
    },
    'stake': {
        'n.': ['股份', '赌注', '利害关系'],
        'vt.': ['以...打赌，拿...冒险']
    },
    'pesticide': {
        'n.': ['杀虫剂，农药']
    },
    'conflict': {
        'vi.': ['冲突', '不一致', '争论'],
        'n.': ['冲突', '争论']
    },
    'accumulate': {
        'v.': ['积累，积聚，堆积']
    },
    'eternal': {
        'a.': ['永恒的，不朽的']
    },
    'sting': {
        'v.': ['刺，蜇', '（使）感觉刺痛'],
        'n.': ['（昆虫的）尾刺', '刺痛']
    },
    'extinct': {
        'a.': ['灭绝的，不存在的', '（火山）不再活跃的']
    },
    'respond': {
        'vi.': ['回答，回复', '作出反应', '响应']
    },
    'sunset': {
        'n.': ['日落（时分），傍晚']
    }
}
