#!/usr/bin/env python3
# -*- coding: utf-8 -*-

L = {
    'expertise': {
        'n.': ['专门知识（或技能等），专长']
    },
    'blend': {
        'v.': ['（使）混合，（使）混杂'],
        'n.': ['混合', '混合物']
    },
    'fungus': {
        'n.': ['真菌', '霉菌']
    },
    'elaticity': {
        'n.': ['弹力', '弹性']
    },
    'moisture': {
        'n.': ['潮湿，湿气']
    },
    'gravity': {
        'n.': ['重力', '严重性', '严肃，庄严']
    },
    'stout': {
        'a.': ['结实的，强壮的', '肥胖', '顽强的']
    },
    'assent': {
        'n./vi.': ['同意，赞成']
    },
    'bizarre': {
        'a.': ['奇形怪状的，古怪可笑的，怪诞的']
    },
    'conceit': {
        'n.': ['自负，自大']
    },
    'husbandry': {
        'n.': ['耕种，务农，农牧业']
    },
    'abysmal': {
        'a.': ['深不可测的', '极坏的，糟透的']
    },
    'scorn': {
        'n.': ['轻蔑，鄙视'],
        'v.': ['轻蔑，鄙视', '不屑于']
    },
    'tranquil': {
        'a.': ['安静的，平静的']
    },
    'swoop': {
        'n.': ['突然行动'],
        'v.': ['猛扑', '突然袭击']
    },
    'punch': {
        'vt.': ['拳打', '打孔', '按，压'],
        'n.': ['重拳击打', '冲床，打孔机']
    },
    'mingle': {
        'v.': ['（使）混合', '交往']
    },
    'interim': {
        'n.': ['间隙，过渡期间'],
        'a.': ['短暂的，过渡的']
    },
    'laudable': {
        'a.': ['值得赞美的，值得称赞的']
    },
    'incur': {
        'vt.': ['招致，招惹，遭受']
    },
    'pretext': {
        'n.': ['借口，托词']
    },
    'replica': {
        'n.': ['复制品']
    },
    'siege': {
        'n.': ['包围，围困', '封锁']
    },
    'lunge': {
        'vi./n.': ['猛冲，猛扑']
    },
    'basement': {
        'n.': ['地下室，地窖', '建筑物的底部']
    },
    'crude': {
        'a.': ['天然的，未提炼的', '粗糙的', '粗俗的']
    },
    'gibe': {
        'n./v.': ['嘲弄，讥笑']
    },
    'community': {
        'n.': ['社会', '社团', '（动、植物的）群落', '共同体']
    },
    'speckle': {
        'v.': ['弄上斑点', '点缀'],
        'n.': ['斑点', '色斑']
    },
    'beaver': {
        'vi.': ['忙于'],
        'n.': ['海狸', '海狸毛皮']
    },
    'pollutant': {
        'n.': ['污染物质，有害物质']
    },
    'sardonic': {
        'a.': ['嘲笑的，讥讽的']
    },
    'practical': {
        'a.': ['实用的', '实际的', '现实的']
    },
    'circular': {
        'a.': ['圆形的，环形的', '循环的', '绕行的']
    },
    'disappoint': {
        'v.': ['（使）失望，（使）扫兴']
    },
    'nomadic': {
        'a.': ['游牧的', '流浪的']
    },
    'soft': {
        'a.': ['柔软的', '柔和的', '不强烈的', '心肠软的', '软性的']
    },
    'talent': {
        'n.': ['天赋', '才干', '人才']
    },
    'confer': {
        'v.': ['授予', '协商，商讨']
    },
    'incessantly': {
        'ad.': ['不断地']
    },
    'stadium': {
        'n.': ['竞走场', '运动场']
    },
    'budget': {
        'n.': ['预算'],
        'v.': ['做预算'],
        'a.': ['价格低廉的']
    },
    'dominate': {
        'v.': ['支配，统治', '控制', '盛行']
    },
    'intelligence': {
        'n.': ['智力，智慧', '情报']
    },
    'ultimatum': {
        'n.': ['最后通牒']
    },
    'personality': {
        'n.': ['个性', '性格', '名人']
    },
    'decrease': {
        'v.': ['减少'],
        'n.': ['减少（量）']
    },
    'milieu': {
        'n.': ['出身背景', '社会环境']
    },
    'satiric': {
        'a.': ['讽刺的，嘲讽的']
    },
    'alchemist': {
        'n.': ['炼金术士']
    },
    'untamed': {
        'a.': ['未驯服的，难驾驭的']
    },
    'diffusion': {
        'n.': ['散布，扩散', '传播']
    },
    'stream': {
        'v.': ['涌'],
        'n.': ['溪流', '串，股']
    },
    'clipper': {
        'n.': ['快速帆船', '剪刀']
    },
    'equivalent': {
        'n.': ['对等物', '等价物'],
        'a.': ['相同的', '相当的']
    },
    'fray': {
        'vi.': ['磨损，磨破', '（使）烦躁，恼火'],
        'n.': ['争斗']
    },
    'prolific': {
        'a.': ['多产的', '富有创造力的']
    },
    'revolution': {
        'n.': ['革命', '巨变', '旋转']
    },
    'crab': {
        'n.': ['蟹，螃蟹']
    },
    'inhabit': {
        'vt.': ['居住于，栖居于']
    },
    'tissue': {
        'n.': ['组织']
    },
    'precede': {
        'v.': ['在...之前，先于']
    },
    'mushroom': {
        'n.': ['蘑菇'],
        'vi': ['迅速成长']
    },
    'listless': {
        'a.': ['怠倦的，没精打采的']
    },
    'stretch': {
        'n.': ['一段路程', '延伸'],
        'v.': ['延伸，拉长']
    },
    'recharge': {
        'v.': ['充电', '修整', '再装弹药']
    },
    'groom': {
        'v.': ['（给动物）刷洗', '（给...）梳理毛发', '培养，训练'],
        'n.': ['马夫', '新郎']
    },
    'dim': {
        'a.': ['模糊的', '暗淡的', '朦胧的', '不乐观的'],
        'v.': ['（使）变暗淡', '（使）变冷漠']
    },
    'quantify': {
        'vt.': ['以数量表示，量化']
    },
    'equitable': {
        'a.': ['公平的，公正的']
    },
    'appreciate': {
        'vt.': ['赏识', '鉴赏，欣赏', '感激']
    },
    'neuron': {
        'n.': ['神经元，神经细胞']
    },
    'glare': {
        'n.': ['耀眼的光', '怒视，瞪眼'],
        'v.': ['怒目而视', '发出刺眼的光']
    },
    'marsh': {
        'n.': ['沼泽，湿地']
    },
    'foul': {
        'a.': ['污秽的，肮脏的', '充满脏话的，辱骂性的', '邪恶的']
    },
    'eclipse': {
        'vt.': ['（月球、地球等）遮住（...的）光', '使相形见拙'],
        'n.': ['日食，月食']
    },
    'incentive': {
        'n.': ['刺激', '动机']
    },
    'command': {
        'n./v.': ['命令', '指挥，统率']
    },
    'puncture': {
        'v.': ['刺穿', '（使）泄气，挫伤（某人的锐气）'],
        'n.': ['小孔', '刺伤']
    },
    'corrosive': {
        'a.': ['腐蚀（性）的']
    },
    'picky': {
        'a.': ['挑剔的，难以取悦的']
    },
    'raven': {
        'a.': ['乌黑光亮的'],
        'n.': ['渡鸦']
    },
    'durable': {
        'a.': ['持久的，耐用的']
    },
    'approve': {
        'v.': ['批准', '赞成']
    },
    'jot': {
        'vt.': ['草草记下，匆匆记下']
    },
    'prudent': {
        'a.': ['谨慎的', '深谋远虑的']
    },
    'ratify': {
        'vt.': ['正式批准,使正式生效']
    },
    'athlete': {
        'n.': ['运动员，体育家']
    },
    'ideology': {
        'n.': ['思想体系', '意识形态']
    },
    'spur': {
        'n.': ['刺激（物）', '激励', '马刺'],
        'vt.': ['激励，鼓舞', '刺激，促进']
    },
    'vice': {
        'n.': ['恶行，恶习', '副，代理']
    },
    'oyster': {
        'n.': ['牡蛎，蚝']
    },
    'debatable': {
        'a.': ['有争议的']
    }
}
