#!/usr/bin/env python3
# -*- coding: utf-8 -*-

L = {
    'rhinoceros': {
        'n.': ['犀牛']
    },
    'herald': {
        'vt.': ['预兆', '宣布，宣告'],
        'n.': ['信使', '预示，预兆']
    },
    'affirm': {
        'v.': ['断言，坚持声称', '证实，确认']
    },
    'modem': {
        'n.': ['调制解调器']
    },
    'compensate': {
        'v.': ['赔偿，弥补']
    },
    'wax': {
        'v.': ['给...打蜡', '（月亮）渐满'],
        'n.': ['蜡', '蜡状物']
    },
    'psychoanalysis': {
        'n.': ['心理分析，精神分析']
    },
    'least': {
        'a.': ['最小的', '最少的', '最不重要的'],
        'ad.': ['最小', '最少', '微不足道']
    },
    'differentiate': {
        'v.': ['（使）不同，区别']
    },
    'cardinal': {
        'a.': ['主要的，最重要的'],
        'n.': ['红衣凤头鸟']
    },
    'organism': {
        'n.': ['生物，有机物', '有机体']
    },
    'refund': {
        'n.': ['偿还额', '退款'],
        'vt.': ['退换（钱款），偿付']
    },
    'herb': {
        'n.': ['药草，（调味用的）香草', '草本植物']
    },
    'federal': {
        'a.': ['联邦的', '联邦制的', '联邦政府的']
    },
    'conceal': {
        'vt.': ['隐蔽', '隐瞒', '覆盖']
    },
    'otherwise': {
        'ad.': ['另样，用别的方法', '在其他方面'],
        'conj.': ['要不然，否则']
    },
    'steady': {
        'a.': ['牢固的', '稳定的', '沉稳的，可靠的'],
        'v.': ['（使）平稳', '稳定下来', '使稳定']
    },
    'ignore': {
        'vt.': ['忽视', '不顾，不理']
    },
    'originate': {
        'v.': ['起源', '发起', '创立']
    },
    'aerial': {
        'a.': ['空中的，地表以上的', '从飞行器上的'],
        'n.': ['天线']
    },
    'lipid': {
        'n.': ['脂质，类脂']
    },
    'interactive': {
        'a.': ['交互式的', '合作的，互相配合的']
    },
    'charisma': {
        'n.': ['超凡魅力', '感召力', '号召力']
    },
    'affable': {
        'a.': ['和蔼可亲的，易于交谈的，友善的']
    },
    'disconcert': {
        'vt.': ['使惊慌，使不安', '使困惑']
    },
    'induct': {
        'vt.': ['使正式就任', '使了解，传授', '使入伍']
    },
    'wedge': {
        'n.': ['楔子，楔形物'],
        'vt.': ['揳入，塞入']
    },
    'cohesive': {
        'a.': ['黏着的', '使凝固的，使内聚的']
    },
    'rape': {
        'vt./n.': ['强奸', '肆意破坏']
    },
    'animate': {
        'a.': ['活的，有生命的'],
        'vt.': ['赋予生命，使有活力']
    },
    'culminate': {
        'vi.': ['达到顶点', '（以某种结果）告终', '【天】到中天']
    },
    'predation': {
        'n.': ['掠夺', '掠食']
    },
    'gloss': {
        'n.': ['光泽，色泽', '亮光漆', '注解'],
        'v.': ['（使）有光泽']
    },
    'adjoin': {
        'v.': ['贴近，紧挨，毗连']
    },
    'shear': {
        'v.': ['剪（羊毛、头发等）', '切断，剪切']
    },
    'triumph': {
        'n.': ['狂喜', '胜利，成功'],
        'v.': ['获胜，成功']
    },
    'query': {
        'n.': ['疑问，问题'],
        'v.': ['向...提问', '对...表示怀疑']
    },
    'incredulous': {
        'a.': ['怀疑的，不轻信的']
    },
    'puritanical': {
        'a.': ['极守道德的']
    },
    'anonymous': {
        'a.': ['匿名的，不具名的', '无特色的，无个性特征的']
    },
    'savage': {
        'a.': ['凶残的', '野蛮的，未开化的'],
        'n.': ['野蛮人，未开化的人'],
        'vt.': ['残害', '激烈抨击']
    },
    'cider': {
        'n.': ['苹果酒', '苹果汁']
    },
    'barn': {
        'n.': ['谷仓', '牲口棚']
    },
    'uneven': {
        'a.': ['不平均的', '不平坦的', '不规则的', '（指竞争、比赛等）不势均力敌的', '不公平的']
    },
    'awake': {
        'v.': ['唤醒', '醒', '觉醒，醒悟'],
        'a.': ['醒着的', '警觉的']
    },
    'stingy': {
        'a.': ['吝啬的，小气的']
    },
    'bargain': {
        'n.': ['特价商品，廉价货', '协议', '交易'],
        'vi.': ['讨价还价']
    },
    'exceed': {
        'v.': ['超过，超出']
    },
    'forestall': {
        'vt.': ['预防，预先阻止', '先发制人']
    },
    'concave': {
        'a.': ['凹的']
    },
    'acknowledge': {
        'v.': ['承认，确认', '对...表示感谢']
    },
    'boast': {
        'v./n.': ['自我夸耀']
    },
    'distribute': {
        'vt.': ['分配，分发', '散布']
    },
    'turnout': {
        'n.': ['（比赛、会议等的）出席人数', '产量，产额']
    },
    'reinforce': {
        'vt.': ['加固，加强', '增援']
    },
    'jolt': {
        'v.': ['（使）震动，颠簸', '（使）震惊'],
        'n.': ['震动，颠簸', '震惊', '一阵强烈的感情等']
    },
    'spiral': {
        'vi.': ['盘旋', '盘旋上升（或下降）', '（物价等）急剧增长'],
        'a.': ['螺旋形的'],
        'n.': ['螺旋形', '螺旋式的上升（或下降）']
    },
    'perspective': {
        'n.': ['展望', '观点，看法', '远景', '透视图，透视法', '前途']
    },
    'mask': {
        'n.': ['面具', '面罩', '假面具，伪装'],
        'vt.': ['掩饰，掩藏']
    },
    'hitherto': {
        'ad.': ['迄今，至今']
    },
    'comet': {  
        'n.': ['彗星']
    },
    'sociology': {
        'n.': ['社会学']
    },
    'vault': {
        'n.': ['拱顶', '金库，保险库', '撑杆跳'],
        'v.': ['（用手支撑或撑杆）跳过']
    },
    'efficiency': {
        'n.': ['效率，功效']
    },
    'mime': {
        'v.': ['模拟，模仿'],
        'n.': ['喜剧', '哑剧', '哑剧演员', '模拟表演']
    },
    'stratigraphy': {
        'n.': ['地层学', '地层中的岩石组成']
    },
    'advance': {
        'v.': ['前进，向前移动', '发展，进步', '促进', '预付'],
        'n.': ['前进', '进展', '预付（款）'],
        'a.': ['预先的', '先头的']
    },
    'estimate': {
        'v.': ['评估，估计', '估价'],
        'n.': ['估计', '估价', '评价，看法']
    },
    'impetus': {
        'n.': ['促进，推动', '刺激', '推动力']
    },
    'attend': {
        'v.': ['出席，参加', '照料，看管', '专心，注意', '陪同']
    },
    'solar': {
        'a.': ['太阳的，日光的', '（利用）太阳能的']
    },
    'lodge': {
        'n.': ['（海狸等的）巢穴', '旅社', '乡间小屋'],
        'v.': ['正式提出', '租住，借宿', '为...提供住宿', '寄存']
    },
    'commentary': {
        'n.': ['评论，注释', '（尤指电视台或电台所作的）实况报道，现场解说']
    },
    'instruct': {
        'vt.': ['指示', '教授']
    },
    'gorilla': {
        'n.': ['大猩猩']
    },
    'logical': {
        'a.': ['逻辑的', '符合逻辑的，合理的', '有逻辑头脑的']
    },
    'incubate': {
        'v.': ['孵化', '培育（细菌等）', '（疾病）潜伏']
    },
    'monster': {
        'n.': ['怪物', '庞然大物', '恶魔'],
        'a.': ['巨大的，庞大的']
    },
    'intriguing': {
        'a.': ['引起兴趣（或好奇心）的，吸引人的']
    },
    'sedimentary': {
        'a.': ['沉积的，沉淀性的']
    },
    'participate': {    
        'vi.': ['参与，参加']
    },
    'resemble': {
        'vt.': ['与...相似，像']
    },
    'mason': {
        'n.': ['石匠，泥瓦匠']
    },
    'nationalism': {    
        'n.': ['国家主义', '民族主义，民族优越感']
    },
    'heading': {
        'n.': ['标题', '主题']
    },
    'unpredictable': {
        'a.': ['不可预知的', '无法预言的']
    },
    'preoccupation': {
        'n.': ['主要考虑因素', '全神贯注']
    }
}
