#!/usr/bin/env python3
# -*- coding: utf-8 -*-

L = {
    'communal': {
        'a': ['公共的，共享的', '社区的']
    },
    'fragile': {
        'a.': ['易碎的', '脆弱的', '纤巧的', '虚弱的']
    },
    'agile': {
        'a.': ['敏捷的，灵活的']
    },
    'competence': {
        'n.': ['能力，胜任', '权限', '技能']
    },
    'lettuce': {
        'n.': ['生菜', '莴苣']
    },
    'vacant': {
        'a.': ['空的', '闲置的', '（神情等）茫然的，（心灵）空虚的']
    },
    'apportion': {
        'vt.': ['分配', '分派']
    },
    'emotional': {
        'a.': ['感情（上）的，情绪（上）的', '引起情感的', '易动感情的']
    },
    'juvenile': {
        'n.': ['幼体', '未成年人，少年'],
        'a.': ['幼稚的，不成熟的', '少年的，未成年的']
    },
    'status': {
        'n.': ['身份，地位', '情况']
    },
    'promote': {
        'vt.': ['促进', '提升', '宣传，传销']
    },
    'academic': {
        'a.': ['学术的', '学校的，学院的', '纯理论的'],
        'n.': ['大学教师']
    },
    'rigor': {
        'n.': ['严格', '（气候、条件等的）严酷']
    },
    'complex': {
        'a.': ['合成的，综合的', '复杂的，错综的，难以理解的'],
        'n.': ['建筑群', '综合体，集合体', '情结']
    },
    'X-ray': {
        'n.': ['X 射线，X 光', 'X 光照片']
    },
    'franchise': {
        'n.': ['特权，特许', '特许经销权', '（公民）选举权'],
        'vt.': ['赋予特权', '区域选举权']
    },
    'item': {
        'n.': ['项目，条款', '一件商品（或物品）', '（新闻等的）一条，一则']
    },
    'grip': {
        'v.': ['控制', '紧握，吸引住...的注意'],
        'n.': ['控制，影响力', '紧握', '理解']
    },
    'ridiculous': {
        'a.': ['荒唐的，可笑的']
    },
    'mode': {
        'n.': ['方式，形式', '风格', '时尚']
    },
    'cactus': {
        'n.': ['仙人掌']
    },
    'silica': {
        'n.': ['硅石，硅土', '二氧化硅']
    },
    'willful': {
        'a.': ['成心的，有意的', '任性的']
    },
    'refraction': {
        'n.': ['折射']
    },
    'fortuitous': {
        'a.': ['偶然的，意外的']
    },
    'insight': {
        'n.': ['洞察力', '领悟']
    },
    'discard': {
        'vt.': ['丢弃']
    },
    'concept': {
        'n.': ['概念，观念', '设想']
    },
    'swift': {
        'a.': ['敏捷的，速度快的'],
        'n.': ['雨燕']
    },
    'noted': {
        'a.': ['著名的']
    },
    'release': {
        'n./vt.': ['释放', '发布，公开', '发泄']
    },
    'propensity': {
        'n.': ['倾向，癖好']
    },
    'fable': {
        'n.': ['寓言', '谎言']
    },
    'diplomat': {
        'n.': ['外交官', '有手腕的人']
    },
    'mutual': {
        'a.': ['相互的', '共有的']
    },
    'odd': {
        'a.': ['单数的', '奇数的', '奇异的，古怪的', '偶尔发生的']
    },
    'confidant': {
        'n.': ['知己，密友']
    },
    'bureaucracy': {
        'n.': ['官僚主义，官僚作风', '政府机构，官僚机构']
    },
    'abate': {
        'v.': ['（使）减少，减轻']
    },
    'dignify': {
        'vt.': ['使有尊严，使高贵', '美化']
    },
    'feign': {
        'vt.': ['装作，假装', '伪造']
    },
    'melodious': {
        'a.': ['旋律优美的，悦耳的']
    },
    'disastrous': {
        'a.': ['灾难性的']
    },
    'complaint': {
        'n.': ['诉苦，抱怨', '投诉', '控告']
    },
    'negligent': {
        'a.': ['忽略的', '疏忽的', '粗心大意的']
    },
    'frail': {
        'a.': ['（指人）体弱的，虚弱的', '易碎的']
    },
    'blaze': {
        'n.': ['火焰', '光辉，强烈（或眩目）的光', '（感情的）迸发'],
        'vi': ['燃烧，着火', '发光，放光彩', '怒视']
    },
    'cherish': {
        'vt.': ['爱护，珍爱', '怀有，抱有（希望等）']
    },
    'snide': {
        'a.': ['伪造的', '不诚实的', '讽刺的，挖苦的，含沙射影的']
    },
    'empiricism': {
        'n.': ['经验论，经验主义']
    },
    'falter': {
        'v.': ['衰退，衰落', '（声音）发抖，结巴地说', '蹒跚']
    },
    'mismanage': {
        'vt.': ['对...管理不当', '处理不当']
    },
    'lust': {   
        'n.': ['性欲', '强烈的欲望'],
        'v.': ['对...有强烈的欲望']
    },
    'stampede': {
        'v.': ['（使）狂奔，涌向', '使仓促行事'],
        'n.': ['逃窜，狂奔', '热潮，风尚']
    },
    'overnight': {
        'a.': ['通宵的，一整夜的', '一夜之间的'],
        'ad.': ['整夜', '一夜之间']
    },
    'torpor': {
        'n.': ['迟钝', '死气沉沉']
    },
    'shed': {
        'vt.': ['抛弃', '摆脱', '流出', '散发', '发出（光等）', '脱落'],
        'n.': ['小屋']
    },
    'hierarchy': {
        'n.': ['统治集团', '等级制度', '阶层']
    },
    'aluminum': {   
        'n.': ['铝']
    },
    'deplete': {
        'vt.': ['使枯竭，耗尽']
    },
    'pattern': {
        'n.': ['模式，方式', '样式，图案', '样品，样本'],
        'vt.': ['仿制', '使形成，促成']
    },
    'shirk': {
        'v.': ['逃避，规避']
    },
    'dormant': {
        'a.': ['静止的', '休眠的', '隐匿的']
    },
    'quasar': {
        'n.': ['类星体']
    },
    'humorous': {
        'a.': ['幽默的，滑稽的，诙谐的']
    },
    'bolster': {
        'vt.': ['支持', '改善'],
        'n.': ['垫子，枕垫']
    },
    'cite': {
        'vt.': ['引用，引证', '传唤，传讯', '表彰，嘉奖']
    },
    'offensive': {
        'a.': ['攻击性的', '冒犯的，使人不快的', '攻方的'],
        'n.': ['进攻，攻击', '攻势']
    },
    'emerge': {
        'vi.': ['显露，暴露', '（从水中）出来，现出']
    },
    'tactic': {
        'n.': ['手段，策略', '战术']
    },
    'awareness': {
        'n.': ['知道，意识，察觉']
    },
    'distract': {
        'vt.': ['分散注意力，使分心']
    },
    'rehabilitate': {
        'vt.': ['使恢复原状，修复', '改造（犯罪等），使恢复正常生活', '恢复...的名誉']
    },
    'blizzard': {
        'n.': ['暴风雪，大风雪']
    },
    'mold': {
        'n.': ['霉菌', '模型'],
        'vt.': ['塑造']
    },
    'ease': {
        'n.': ['不费力，容易', '悠闲，自在'],
        'v.': ['缓和，减轻']
    },
    'roe': {
        'n.': ['鱼卵']
    },
    'fin': {
        'n.': ['鳍', '鳍状物', '（飞机等的）翼']
    },
    'mythology': {
        'n.': ['神话', '神话学', '虚幻的想法']
    },
    'drastic': {
        'a.': ['剧烈的，猛烈的，激烈的']
    },
    'healing': {
        'a.': ['有治疗功用的'],
        'n.': ['康复，治疗', '复原']
    },
    'blush': {
        'vi.': ['脸红', '羞愧'],
        'n.': ['（因羞愧等）脸上泛起的红晕']
    },
    'melodic': {
        'a.': ['旋律的，曲调的', '音调优美的']
    },
    'cubism': {
        'n.': ['立体派', '立体主义']
    },
    'magnet': {
        'n.': ['磁铁，磁体', '有吸引力的人（或事物）']
    },
    'pensive': {
        'a.': ['沉思的', '忧虑的']
    },
    'signify': {
        'v.': ['意味', '表示，预示', '要紧，有重要性']
    },
    'aware': {
        'a.': ['知道的', '意识到的']
    },
    'informant': {
        'n.': ['提供消息或情报的人，线人', '（为研究）提供资料的人', '合作者']
    },
    'dubious': {
        'a.': ['怀疑的，拿不准的', '可疑的，靠不住的']
    },
    'proponent': {
        'n.': ['支持者', '提倡者']
    },
    'narrate': {
        'v.': ['讲述，叙述']
    },
    'former': {
        'a.': ['从前的'],
        'n.': ['前者']
    },
    'accredit': {
        'vt.': ['委任，授权', '把...归于', '正式认可']
    },
    'puddle': {
        'n.': ['水坑，水洼']
    },
    'tragic': {
        'a.': ['悲惨的', '悲剧的']
    },
    'assert': {
        'v.': ['断言，声称']
    },
    'concomitant': {
        'a.': ['伴随的'],
        'n.': ['伴随物']
    }
}
