#!/usr/bin/env python3
# -*- coding: utf-8 -*-

L = {
    'oversleep': {
        'v.': ['（使）睡过头', '（使）睡得过久']
    },
    'terrific': {
        'a.': ['极好的', '非常的，极度的', '可怕的']
    },
    'motif': {
        'n.': ['主题，主旨', '（装饰）图形']
    },
    'parachute': {
        'n.': ['降落伞'],
        'v.': ['跳伞', '空投']
    },
    'shore': {
        'n.': ['（江、河、湖、海等的）滨，岸'],
        'vt.': ['支撑，支持']
    },
    'chapel': {
        'n.': ['（小）教堂', '祈祷室']
    },
    'pollinate': {
        'vt.': ['给...授粉']
    },
    'depict': {
        'vt.': ['描写，描述，描绘']
    },
    'courageous': {
        'a.': ['勇敢的，有胆量的']
    },
    'twig': {
        'n.': ['嫩枝，小枝']
    },
    'ablaze': {
        'a.': ['着火的，燃烧的', '闪耀的', '情绪激动的']
    },
    'vacate': {
        'vt.': ['腾出，空出', '离（职），退（位）']
    },
    'explosion': {
        'n.': ['爆炸', '爆发', '激增']
    },
    'virtue': {
        'n.': ['美德', '优点']
    },
    'course': {
        'n.': ['课程，教程', '过程，进程', '路线', '一道菜']
    },
    'feudal': {
        'a.': ['封建（制度）的']
    },
    'sustenance': {
        'n.': ['食物', '生计', '维持']
    },
    'tend': {
        'v.': ['趋于，易于', '照料，看护']
    },
    'charcoal': {
        'n.': ['木炭']
    },
    'varied': {
        'a.': ['各式各样的']
    },
    'offer': {
        'v.': ['提供', '自愿给予', '提出，提议'],
        'n.': ['提议', '报价，出价', '特价']
    },
    'axis': {
        'n.': ['轴', '轴线，中心线']
    },
    'feminist': {
        'n.': ['女权主义者']
    },
    'identification': {
        'n.': ['身份证明', '辨认，鉴定']
    },
    'audio': {
        'a.': ['音频的', '声音的']
    },
    'caterpillar': {
        'n.': ['毛毛虫']
    },
    'rash': {
        'a.': ['鲁莽的，轻巧的'],
        'n.': ['疹，皮疹', '（短时间内出现的）一连串令人不快的事物']
    },
    'appeal': {
        'vi.': ['上诉，起诉', '呼吁，恳求', '吸引'],
        'n.': ['上诉，申诉', '呼吁，恳求', '感染力，吸引力']
    },
    'modify': {
        'vt.': ['修改，更改', '缓和', '【语】修饰']
    },
    'diversity': {
        'n.': ['多样性']
    },
    'comprehend': {
        'v.': ['理解，领会', '包括，由...组成']
    },
    'timber': {
        'n.': ['木材，木料']
    },
    'astute': {
        'a.': ['机敏的，精明的']
    },
    'uniform':{
        'n.': ['制服'],
        'a.': ['统一的', '均匀的']
    },
    'luminous': {
        'a.': ['发光的，明亮的']
    },
    'tavern': {
        'n.': ['小旅馆，客栈', '小酒店']
    },
    'conciliate': {
        'vt.': ['安抚，抚慰', '调和']
    },
    'devout': {
        'a.': ['虔敬的', '诚恳的']
    },
    'gait': {
        'n.': ['步法，步态']
    },
    'gouge': {
        'vt.': ['挖出', '敲竹杠'],
        'n.': ['凿子']
    },
    'candid': {
        'a.': ['坦白的，直率的，直言不讳的']
    },
    'terrorism': {
        'n.': ['恐怖主义']
    },
    'subjugate': {
        'vt.': ['征服，制伏，使服从']
    },
    'throng': {
        'n.': ['一大群人'],
        'v.': ['群集，拥向']
    },
    'corporeal': {
        'a.': ['肉体的，身体的', '物质的', '实体的']
    },
    'invasive': {
        'a.': ['侵入的，侵略的', '开刀的']
    },
    'stray': {
        'vi.': ['迷路', '分心，走神', '离题'],
        'a.': ['迷路的', '孤立的'],
        'n.': ['走失的家畜', '离群者']
    },
    'practicable': {
        'a.': ['能实行的，可行的，适用的']
    },
    'modernity': {
        'n.': ['现代性']
    },
    'contempt': {
        'n.': ['轻视，鄙视，轻蔑']
    },
    'antonym': {
        'n.': ['反义词']
    },
    'tuition': {
        'n.': ['学费', '（某一学科的）教学，教授']
    },
    'emergent': {
        'a.': ['突现的', '新兴的', '紧急的']
    },
    'outrageous': {
        'a.': ['残暴的', '骇人的', '反常的，过度的']
    },
    'vain': {
        'a.': ['徒然的，无效的', '自负的，虚荣的']
    },
    'advantage': {
        'n.': ['优点', '优势，有利条件'],
        'vt.': ['有利于']
    },
    'decisive': {
        'a.': ['决定性的', '果断的']
    },
    'corona': {
        'n.': ['日冕，日华', '光环']
    },
    'neglect': {
        'vt./n.': ['忽略，忽视', '疏忽']
    },
    'deciduous': {
        'a.': ['（树木等）落叶的', '非永久的，短暂的']
    },
    'utilitarian': {
        'a.': ['实用的', '功利主义的'],
        'n.': ['功利主义者']
    },
    'subtract': {
        'vt.': ['减去']
    },
    'perceptive': {
        'a.': ['感知的，知觉的', '有洞察力的，理解力强的']
    },
    'commission': {
        'n.': ['授权，委任', '委员会', '佣金，回扣'],
        'vt.': ['委托，授权']
    },
    'breakthrough': {
        'n.': ['突破，重大进展']
    },
    'inspire': {
        'vt.': ['鼓舞，激励', '给...以灵感']
    },
    'cognition': {
        'n.': ['感知，认知，认识']
    },
    'penicillin': {
        'n.': ['青霉素，盘尼西林']
    },
    'ethnology': {
        'n.': ['民族学，文化人类学']
    },
    'volcano': {
        'n.': ['火山']
    },
    'cellist': {
        'n.': ['大提琴演奏家']
    },
    'uniformity': {
        'n.': ['同样，一致', '一致性']
    },
    'neutron': {
        'n.': ['中子']
    },
    'informed': {
        'a.': ['有学识的', '见识多广的，有见识的']
    },
    'rate': {
        'n.': ['率，比率', '速度', '价格', '等级'],
        'v.': ['估价', '评级，评价', '把...列为']
    },
    'underneath': {
        'prep.': ['在...下面'],
        'ad.': ['在下面']
    },
    'maneuver': {
        'v.': ['操纵，控制', '耍花招'],
        'n.': ['策略', '花招']
    },
    'journalism': {
        'n.': ['新闻业，新闻工作']
    },
    'terrain': {
        'n.': ['地势，地形', '地带']
    },
    'excursion': {
        'n.': ['远足，短途旅游']
    },
    'saturation': {
        'n.': ['饱和（状态）', '饱和度']
    },
    'abundant': {
        'a.': ['大量的，充足的，丰富的']
    },
    'rehearse': {
        'v.': ['预演，排练', '默诵', '照搬，重复']
    },
    'subsist': {
        'vi.': ['存活，生存']
    },
    'cascara': {
        'n.': ['缓泻剂']
    }
}
